Please remove the network and subnet creation from the test case.  That is not a real world scenario.  The application group creating the forwarding rule is not the networking team and should never manage any network resources.

---

### CODE
Here is the code that will reproduce the error.
```tf
locals {
  project_id = "iMY_PROJECT_ID"
  network = "hub"
  region = "us-central1"
  zone = "us-central1-b"
}

resource "google_compute_address" "ilb_ipaddr" {
  name         = "${local.network}-ilb-${local.region}"
  project      = local.project_id
  region       = local.region
  subnetwork   = "${local.network}-priv-${local.region}"
  address_type = "INTERNAL"
  purpose      = "SHARED_LOADBALANCER_VIP"
}

resource "google_compute_region_health_check" "hc_tcp" {
  depends_on          = [google_compute_address.ilb_ipaddr]
  name                = "${local.network}-hc-tcp-${local.region}"
  project             = local.project_id
  region              = local.region
  tcp_health_check {
    port               = 80
    port_specification = "USE_FIXED_PORT"
  }
}

resource "google_compute_instance_group" "inst_grp" {
  depends_on  = [google_compute_address.ilb_ipaddr]
  name        = "${local.network}-ig-${local.region}"
  project     = local.project_id
  network     = "projects/${local.project_id}/global/networks/${local.network}"
  zone        = local.zone
  instances   = []
}

resource "google_compute_region_backend_service" "backend" {
  name                            = "${local.network}-bes-${local.region}"
  project                         = local.project_id
  region                          = local.region
  backend {
    balancing_mode = "CONNECTION"
    group          = google_compute_instance_group.inst_grp.id
  }
  health_checks = [
    google_compute_region_health_check.hc_tcp.id
  ]
}

resource "google_compute_forwarding_rule" "fwd_rule" {
  name                   = "${local.network}-fwdrul-${local.region}"
  project                = local.project_id
  region                 = local.region
  load_balancing_scheme  = "INTERNAL"
  backend_service        = google_compute_region_backend_service.backend.self_link
  allow_global_access    = true
  is_mirroring_collector = false
  network_tier           = "PREMIUM"
  network                = local.network
  subnetwork             = google_compute_address.ilb_ipaddr.subnetwork
  ip_protocol            = "TCP"
  ip_address             = google_compute_address.ilb_ipaddr.address
  all_ports              = true
}
```

### ERROR
Here is the results I get when when I run terraform.
```tf
$ terraform apply -auto-approve
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:
  # google_compute_address.ilb_ipaddr will be created
  + resource "google_compute_address" "ilb_ipaddr" {
      + address            = (known after apply)
      + address_type       = "INTERNAL"
      + creation_timestamp = (known after apply)
      + effective_labels   = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "hub-ilb-us-central1"
      + network_tier       = (known after apply)
      + prefix_length      = (known after apply)
      + project            = "MY_PROJECT_ID"
      + purpose            = "SHARED_LOADBALANCER_VIP"
      + region             = "us-central1"
      + self_link          = (known after apply)
      + subnetwork         = "hub-priv-us-central1"
      + terraform_labels   = (known after apply)
      + users              = (known after apply)
    }

  # google_compute_forwarding_rule.fwd_rule will be created
  + resource "google_compute_forwarding_rule" "fwd_rule" {
      + all_ports              = true
      + allow_global_access    = true
      + backend_service        = (known after apply)
      + base_forwarding_rule   = (known after apply)
      + creation_timestamp     = (known after apply)
      + effective_labels       = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + ip_protocol            = "TCP"
      + ip_version             = (known after apply)
      + is_mirroring_collector = false
      + label_fingerprint      = (known after apply)
      + load_balancing_scheme  = "INTERNAL"
      + name                   = "hub-fwdrul-us-central1"
      + network                = "hub"
      + network_tier           = "PREMIUM"
      + port_range             = (known after apply)
      + project                = "MY_PROJECT_ID"
      + psc_connection_id      = (known after apply)
      + psc_connection_status  = (known after apply)
      + recreate_closed_psc    = false
      + region                 = "us-central1"
      + self_link              = (known after apply)
      + service_name           = (known after apply)
      + subnetwork             = "hub-priv-us-central1"
      + terraform_labels       = (known after apply)

      + service_directory_registrations (known after apply)
    }

  # google_compute_instance_group.inst_grp will be created
  + resource "google_compute_instance_group" "inst_grp" {
      + id        = (known after apply)
      + instances = (known after apply)
      + name      = "hub-ig-us-central1"
      + network   = "projects/MY_PROJECT_ID/global/networks/hub"
      + project   = "MY_PROJECT_ID"
      + self_link = (known after apply)
      + size      = (known after apply)
      + zone      = "us-central1-b"
    }

  # google_compute_region_backend_service.backend will be created
  + resource "google_compute_region_backend_service" "backend" {
      + connection_draining_timeout_sec = 0
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + generated_id                    = (known after apply)
      + health_checks                   = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "INTERNAL"
      + name                            = "hub-bes-us-central1"
      + port_name                       = (known after apply)
      + project                         = "MY_PROJECT_ID"
      + protocol                        = (known after apply)
      + region                          = "us-central1"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = (known after apply)

      + backend {
          + balancing_mode = "CONNECTION"
          + failover       = (known after apply)
          + group          = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + cdn_policy (known after apply)

      + log_config (known after apply)
    }

  # google_compute_region_health_check.hc_tcp will be created
  + resource "google_compute_region_health_check" "hc_tcp" {
      + check_interval_sec  = 5
      + creation_timestamp  = (known after apply)
      + healthy_threshold   = 2
      + id                  = (known after apply)
      + name                = "hub-hc-tcp-us-central1"
      + project             = "MY_PROJECT_ID"
      + region              = "us-central1"
      + self_link           = (known after apply)
      + timeout_sec         = 5
      + type                = (known after apply)
      + unhealthy_threshold = 2

      + log_config (known after apply)

      + tcp_health_check {
          + port               = 80
          + port_specification = "USE_FIXED_PORT"
          + proxy_header       = "NONE"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
google_compute_address.ilb_ipaddr: Creating...
google_compute_address.ilb_ipaddr: Still creating... [10s elapsed]
google_compute_address.ilb_ipaddr: Creation complete after 11s [id=projects/MY_PROJECT_ID/regions/us-central1/addresses/hub-ilb-us-central1]
google_compute_instance_group.inst_grp: Creating...
google_compute_region_health_check.hc_tcp: Creating...
google_compute_instance_group.inst_grp: Still creating... [10s elapsed]
google_compute_region_health_check.hc_tcp: Still creating... [10s elapsed]
google_compute_region_health_check.hc_tcp: Creation complete after 10s [id=projects/MY_PROJECT_ID/regions/us-central1/healthChecks/hub-hc-tcp-us-central1]
google_compute_instance_group.inst_grp: Creation complete after 11s [id=projects/MY_PROJECT_ID/zones/us-central1-b/instanceGroups/hub-ig-us-central1]
google_compute_region_backend_service.backend: Creating...
google_compute_region_backend_service.backend: Still creating... [10s elapsed]
google_compute_region_backend_service.backend: Still creating... [20s elapsed]
google_compute_region_backend_service.backend: Creation complete after 20s [id=projects/MY_PROJECT_ID/regions/us-central1/backendServices/hub-bes-us-central1]
╷
│ Error: Provider produced inconsistent final plan
│ 
│ When expanding the plan for google_compute_forwarding_rule.fwd_rule to include new values learned so far during apply, provider "registry.terraform.io/hashicorp/google" produced an invalid new value for .subnetwork:
│ was cty.StringVal("hub-priv-us-central1"), but now cty.StringVal("https://www.googleapis.com/compute/v1/projects/MY_PROJECT_ID/regions/us-central1/subnetworks/hub-priv-us-central1").
│ 
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
```

### RERUN WORKS
It works on the second pass.
```tf
$ terraform apply -auto-approve
google_compute_address.ilb_ipaddr: Refreshing state... [id=projects/MY_PROJECT_ID/regions/us-central1/addresses/hub-ilb-us-central1]
google_compute_instance_group.inst_grp: Refreshing state... [id=projects/MY_PROJECT_ID/zones/us-central1-b/instanceGroups/hub-ig-us-central1]
google_compute_region_health_check.hc_tcp: Refreshing state... [id=projects/MY_PROJECT_ID/regions/us-central1/healthChecks/hub-hc-tcp-us-central1]
google_compute_region_backend_service.backend: Refreshing state... [id=projects/MY_PROJECT_ID/regions/us-central1/backendServices/hub-bes-us-central1]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_forwarding_rule.fwd_rule will be created
  + resource "google_compute_forwarding_rule" "fwd_rule" {
      + all_ports              = true
      + allow_global_access    = true
      + backend_service        = "https://www.googleapis.com/compute/v1/projects/MY_PROJECT_ID/regions/us-central1/backendServices/hub-bes-us-central1"
      + base_forwarding_rule   = (known after apply)
      + creation_timestamp     = (known after apply)
      + effective_labels       = (known after apply)
      + id                     = (known after apply)
      + ip_address             = "10.30.64.2"
      + ip_protocol            = "TCP"
      + ip_version             = (known after apply)
      + is_mirroring_collector = false
      + label_fingerprint      = (known after apply)
      + load_balancing_scheme  = "INTERNAL"
      + name                   = "hub-fwdrul-us-central1"
      + network                = "hub"
      + network_tier           = "PREMIUM"
      + port_range             = (known after apply)
      + project                = "MY_PROJECT_ID"
      + psc_connection_id      = (known after apply)
      + psc_connection_status  = (known after apply)
      + recreate_closed_psc    = false
      + region                 = "us-central1"
      + self_link              = (known after apply)
      + service_name           = (known after apply)
      + subnetwork             = "https://www.googleapis.com/compute/v1/projects/MY_PROJECT_ID/regions/us-central1/subnetworks/hub-priv-us-central1"
      + terraform_labels       = (known after apply)

      + service_directory_registrations (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
google_compute_forwarding_rule.fwd_rule: Creating...
google_compute_forwarding_rule.fwd_rule: Still creating... [10s elapsed]
google_compute_forwarding_rule.fwd_rule: Creation complete after 11s [id=projects/MY_PROJECT_ID/regions/us-central1/forwardingRules/hub-fwdrul-us-central1]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```